wikimedia/smash-pig/PaymentProviders/Gravy/Tests/Data/trustly-create-transaction-failed.json

{
    "type": "transaction",
    "id": "943bec45-7cab-4555-8ea1-def34c34fae9",
    "reconciliation_id": "4ViFS7jBpRXLvyjRw2Zlft",
    "merchant_account_id": "default",
    "currency": "USD",
    "amount": 1223,
    "status": "authorization_declined",
    "authorized_amount": 1223,
    "captured_amount": 0,
    "refunded_amount": 0,
    "settled_currency": null,
    "settled_amount": 0,
    "settled": false,
    "country": "US",
    "external_identifier": "417.2",
    "intent": "authorize",
    "payment_method": {
        "type": "payment-method",
        "approval_url": "https:\/\/cdn.sandbox.wikimedia.gr4vy.app\/connectors\/trustly\/index.html?establishData=%7B%22accessId%22%3A+%22hSmH9694eD10aE2hZ3vZ%22%2C+%22merchantId%22%3A+%221243%22%2C+%22amount%22%3A+%2212.23%22%2C+%22currency%22%3A+%22USD%22%2C+%22description%22%3A+null%2C+%22returnUrl%22%3A+%22https%3A%2F%2Fapi.sandbox.wikimedia.gr4vy.app%2Ftransactions%2Fapprove%2FeyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.lDvsRXyrRVWOod7zTDT66Q.WYKd5xJ7fz3JoF9r_ibUWRbbWaVMVV8vH4zdvqhjx2g%3Fgr4vy_store%3Dfalse%22%2C+%22cancelUrl%22%3A+%22https%3A%2F%2Fapi.sandbox.wikimedia.gr4vy.app%2Ftransactions%2Fapprove%2FeyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.lDvsRXyrRVWOod7zTDT66Q.WYKd5xJ7fz3JoF9r_ibUWRbbWaVMVV8vH4zdvqhjx2g%3Fgr4vy_store%3Dfalse%26cancel%3Dtrue%22%2C+%22notificationUrl%22%3A+%22https%3A%2F%2Fapi.sandbox.wikimedia.gr4vy.app%2Fi%2FFvHCe2RKQiSuXvziv8xIY3RydXN0bHktdHJ1c3RseQ%2FwDFzXDErlmW6lBI3LrpFsdJyIj5vSdxAil57LNpH_WE%22%2C+%22paymentType%22%3A+%22Deferred%22%2C+%22customer%22%3A+%7B%22name%22%3A+%22Jimmy+Wales%22%2C+%22email%22%3A+%22jwales%40example.com%22%2C+%22taxId%22%3A+null%2C+%22externalId%22%3A+null%2C+%22address%22%3A+%7B%22address1%22%3A+%221+Montgomery+Street%22%2C+%22address2%22%3A+null%2C+%22city%22%3A+%22San+Francisco%22%2C+%22state%22%3A+%22CA%22%2C+%22zip%22%3A+%2294104%22%2C+%22country%22%3A+%22US%22%7D%7D%2C+%22merchantReference%22%3A+%224ViFS7jBpRXLvyjRw2Zlft%22%2C+%22requestSignature%22%3A+%22pnUeEddBuBcer4sngHQayFzwDF4%3D%22%7D&trustlyUrl=https%3A%2F%2Fsandbox.trustly.one%2Fstart%2Fscripts%2Ftrustly.js%3FaccessId%3DhSmH9694eD10aE2hZ3vZ",
        "country": "US",
        "currency": "USD",
        "details": null,
        "expiration_date": null,
        "fingerprint": null,
        "label": null,
        "last_replaced_at": null,
        "method": "trustly",
        "mode": "redirect",
        "scheme": null,
        "id": null,
        "approval_target": null,
        "external_identifier": null,
        "payment_account_reference": null
    },
    "method": "trustly",
    "instrument_type": "redirect",
    "error_code": null,
    "payment_service": {
        "type": "payment-service",
        "id": "16f1c27b-644a-4224-ae5e-fce2bfcc4863",
        "payment_service_definition_id": "trustly-trustly",
        "method": "trustly",
        "display_name": "Trustly US"
    },
    "pending_review": false,
    "buyer": {
        "type": "buyer",
        "id": null,
        "display_name": null,
        "external_identifier": "jwales@example.com",
        "billing_details": {
            "first_name": "Jimmy",
            "last_name": "Wales",
            "email_address": "jwales@example.com",
            "phone_number": null,
            "address": {
                "city": "San Francisco",
                "country": "US",
                "postal_code": "94104",
                "state": "CA",
                "state_code": null,
                "house_number_or_name": null,
                "line1": "1 Montgomery Street",
                "line2": null,
                "organization": null
            },
            "tax_id": null
        }
    },
    "raw_response_code": null,
    "raw_response_description": null,
    "shipping_details": null,
    "checkout_session_id": null,
    "gift_card_redemptions": [],
    "gift_card_service": null,
    "created_at": "2025-01-24T15:48:59.702884+00:00",
    "updated_at": "2025-01-24T15:49:36.295014+00:00",
    "airline": null,
    "auth_response_code": null,
    "avs_response_code": null,
    "cvv_response_code": null,
    "payment_source": "ecommerce",
    "merchant_initiated": false,
    "is_subsequent_payment": false,
    "cart_items": [],
    "statement_descriptor": null,
    "scheme_transaction_id": "1025610947",
    "three_d_secure": null,
    "payment_service_transaction_id": "1025610947",
    "additional_identifiers": {
        "payment_service_authorization_id": "1025610947",
        "payment_service_capture_id": null,
        "payment_service_processor_id": null,
        "split_token": "CJC0hMjJMhABGLQBIAAqWv98BLrlsDmS2kM7iBySqbQphWie2BPubK8wSDvbx7YcrKjOR6GxgRM+wtYIQRarGSsCmhB5Cqg83SFb222nO1endl7bGby7\/4k+0FkFON+jncVtJCfnGk6uBg=="
    },
    "metadata": null,
    "authorized_at": "2025-01-24T15:49:36.295014+00:00",
    "captured_at": null,
    "voided_at": null,
    "approval_expires_at": null,
    "buyer_approval_timedout_at": null,
    "intent_outcome": "failed",
    "multi_tender": false,
    "account_funding_transaction": false,
    "recipient": null
}